## Final Project Submission

Please fill out:
* Student name: 
* Student pace: self paced / part time / full time
* Scheduled project review date/time: 
* Instructor name: 
* Blog post URL:

Import necessary libraries

In [1]:
# Import required libraries
import pandas as pd #Data Manipulation
import numpy as np  #Numerical Computing

# Visualisation
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline

Import data into dataframe

In [2]:
# Load the files 
gross_df = pd.read_csv(r'Data\bom.movie_gross.csv')
basic_df = pd.read_csv(r'Data\name.basics.csv')
rt_movie_info_df = pd.read_csv(r'Data\rt.movie_info.tsv', sep='\t')
rt_reviews_df= pd.read_csv(r'Data\rt.reviews.tsv', sep='\t', encoding='latin')
title_akas_df = pd.read_csv(r'Data\title.akas.csv')
title_basics_df = pd.read_csv(r'Data\title.basics.csv')
title_crew_df = pd.read_csv(r'Data\title.crew.csv')
title_principals_df = pd.read_csv(r'Data\title.principals.csv')
rating_df = pd.read_csv(r'Data\title.ratings.csv')
tmdb_movies_df = pd.read_csv(r'Data\tmdb.movies.csv')
tn_budget_df = pd.read_csv(r'Data\tn.movie_budgets.csv')

Overview of the datasets

In [3]:
basic_df.info()
basic_df.head(5)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 606648 entries, 0 to 606647
Data columns (total 6 columns):
 #   Column              Non-Null Count   Dtype
---  ------              --------------   -----
 0   nconst              606648 non-null  object
 1   primary_name        606648 non-null  object
 2   birth_year          82736 non-null   float64
 3   death_year          6783 non-null    float64
 4   primary_profession  555308 non-null  object
 5   known_for_titles    576444 non-null  object
dtypes: float64(2), object(4)
memory usage: 27.8+ MB

,nconst,primary_name,birth_year,death_year,primary_profession,known_for_titles
0,nm0061671,Mary Ellen Bauder,NaN,NaN,"miscellaneous,production_manager,producer","tt0837562,tt2398241,tt0844471,tt0118553"
1,nm0061865,Joseph Bauer,NaN,NaN,"composer,music_department,sound_department","tt0896534,tt6791238,tt0287072,tt1682940"
2,nm0062070,Bruce Baum,NaN,NaN,"miscellaneous,actor,writer","tt1470654,tt0363631,tt0104030,tt0102898"
3,nm0062195,Axel Baumann,NaN,NaN,"camera_department,cinematographer,art_department","tt0114371,tt2004304,tt1618448,tt1224387"
4,nm0062798,Pete Baxter,NaN,NaN,"production_designer,art_department,set_decorator","tt0452644,tt0452692,tt3458030,tt2178256"

Check for duplicates

In [4]:
basic_df.duplicated().value_counts()

False    606648
Name: count, dtype: int64

Clean basic_df. Drop original_title, it is repetitive and renaming primary_title to movie_title for clarity.

In [8]:
basic_df.drop(columns=['original_title'], inplace=True, errors='ignore')
basic_df.rename({'primary_title':'movie_title'}, axis=1, inplace=True)
basic_df.head()

,nconst,primary_name,birth_year,death_year,primary_profession,known_for_titles
0,nm0061671,Mary Ellen Bauder,NaN,NaN,"miscellaneous,production_manager,producer","tt0837562,tt2398241,tt0844471,tt0118553"
1,nm0061865,Joseph Bauer,NaN,NaN,"composer,music_department,sound_department","tt0896534,tt6791238,tt0287072,tt1682940"
2,nm0062070,Bruce Baum,NaN,NaN,"miscellaneous,actor,writer","tt1470654,tt0363631,tt0104030,tt0102898"
3,nm0062195,Axel Baumann,NaN,NaN,"camera_department,cinematographer,art_department","tt0114371,tt2004304,tt1618448,tt1224387"
4,nm0062798,Pete Baxter,NaN,NaN,"production_designer,art_department,set_decorator","tt0452644,tt0452692,tt3458030,tt2178256"

Check %age of Nans to handle missing values

In [6]:
basic_df.isna().sum()*100/len(basic_df)

nconst                 0.000000
primary_name           0.000000
birth_year            86.361778
death_year            98.881889
primary_profession     8.462898
known_for_titles       4.978835
dtype: float64

We have 23% Nan values. Let's fill it with mode. Then change runtime to int type

In [9]:
print(basic_df.columns.tolist())

['nconst', 'primary_name', 'birth_year', 'death_year', 'primary_profession', 'known_for_titles']

In [11]:
basic_df['runtime_minutes'].fillna(90, inplace=True, errors='ignore')
basic_df['runtime_minutes'] = basic_df['runtime_minutes'].astype(int)
basic_df.head(5)

KeyError: 'runtime_minutes'

Splitting to find the dominant genre of the movies for categorical visualization.

In [ ]:
basic_df['genres'] = basic_df['genres'].fillna('Unknown')
basic_df['main_genre'] = basic_df['genres'].str.split(',').str[0]  
basic_df.head()
basic_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 146144 entries, 0 to 146143
Data columns (total 5 columns):
 #   Column           Non-Null Count   Dtype
---  ------           --------------   -----
 0   tconst           146144 non-null  object
 1   movie_title      146144 non-null  object
 2   start_year       146144 non-null  int64
 3   runtime_minutes  146144 non-null  int32
 4   genres           146144 non-null  object
dtypes: int32(1), int64(1), object(3)
memory usage: 5.0+ MB

Overview of gross_df

In [ ]:
gross_df.info()
gross_df.tail()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3387 entries, 0 to 3386
Data columns (total 5 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   title           3387 non-null   object
 1   studio          3382 non-null   object
 2   domestic_gross  3359 non-null   float64
 3   foreign_gross   2037 non-null   object
 4   year            3387 non-null   int64
dtypes: float64(1), int64(1), object(3)
memory usage: 132.4+ KB

,title,studio,domestic_gross,foreign_gross,year
3382,The Quake,Magn.,6200.0,NaN,2018
3383,Edward II (2018 re-release),FM,4800.0,NaN,2018
3384,El Pacto,Sony,2500.0,NaN,2018
3385,The Swan,Synergetic,2400.0,NaN,2018
3386,An Actor Prepares,Grav.,1700.0,NaN,2018

In [ ]:
gross_df.isnull().sum()/len(gross_df)*100

title              0.000000
studio             0.147623
domestic_gross     0.826690
foreign_gross     39.858282
year               0.000000
dtype: float64

In [ ]:
gross_df.duplicated().value_counts()

False    3387
dtype: int64

Drop the Nan rows.

In [ ]:
gross_df.dropna(inplace=True)

In [ ]:
gross_df.reset_index(drop=True, inplace=True)
gross_df

,title,studio,domestic_gross,foreign_gross,year
0,Toy Story 3,BV,415000000.0,652000000,2010
1,Alice in Wonderland (2010),BV,334200000.0,691300000,2010
2,Harry Potter and the Deathly Hallows Part 1,WB,296000000.0,664300000,2010
3,Inception,WB,292600000.0,535700000,2010
4,Shrek Forever After,P/DW,238700000.0,513900000,2010
...,...,...,...,...,...
2002,I Still See You,LGF,1400.0,1500000,2018
2003,The Catcher Was a Spy,IFC,725000.0,229000,2018
2004,Time Freak,Grindstone,10000.0,256000,2018
2005,Reign of Judges: Title of Liberty - Concept Short,Darin Southa,93200.0,5200,2018
2006,Antonio Lopez 1970: Sex Fashion & Disco,FM,43200.0,30000,2018

Change foreign_gross to float to perform math operations

In [ ]:
gross_df['foreign_gross'] = pd.to_numeric(gross_df['foreign_gross'].str.replace(',', '', regex=True))
gross_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2007 entries, 0 to 2006
Data columns (total 5 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   title           2007 non-null   object
 1   studio          2007 non-null   object
 2   domestic_gross  2007 non-null   float64
 3   foreign_gross   2007 non-null   float64
 4   year            2007 non-null   int64
dtypes: float64(2), int64(1), object(2)
memory usage: 78.5+ KB

Pick top 50 performing movies.

In [ ]:
gross_df_sorted = gross_df.sort_values(by='domestic_gross', ascending=False)
gross_df_sorted.head(5)

                             title studio  domestic_gross  foreign_gross  year
1275  Star Wars: The Force Awakens     BV     936700000.0         1131.6  2015
1835                 Black Panther     BV     700100000.0    646900000.0  2018
1834        Avengers: Infinity War     BV     678800000.0         1369.5  2018
1276                Jurassic World   Uni.     652300000.0         1019.4  2015
598          Marvel's The Avengers     BV     623400000.0    895500000.0  2012

In [ ]:
rating_df.info()
rating_df.head(5)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 73856 entries, 0 to 73855
Data columns (total 3 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   tconst         73856 non-null  object
 1   averagerating  73856 non-null  float64
 2   numvotes       73856 non-null  int64
dtypes: float64(1), int64(1), object(1)
memory usage: 1.7+ MB

       tconst  averagerating  numvotes
0  tt10356526            8.3        31
1  tt10384606            8.9       559
2   tt1042974            6.4        20
3   tt1043726            4.2     50352
4   tt1060240            6.5        21

Check for duplicates

In [ ]:
rating_df.duplicated().value_counts()

False    73856
dtype: int64

In [ ]:
tn_budget_df.info()
tn_budget_df.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5782 entries, 0 to 5781
Data columns (total 6 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   id                 5782 non-null   int64
 1   release_date       5782 non-null   object
 2   movie              5782 non-null   object
 3   production_budget  5782 non-null   object
 4   domestic_gross     5782 non-null   object
 5   worldwide_gross    5782 non-null   object
dtypes: int64(1), object(5)
memory usage: 271.2+ KB

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross
0,1,"Dec 18, 2009",Avatar,"$425,000,000","$760,507,625","$2,776,345,279"
1,2,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,"$410,600,000","$241,063,875","$1,045,663,875"
2,3,"Jun 7, 2019",Dark Phoenix,"$350,000,000","$42,762,350","$149,762,350"
3,4,"May 1, 2015",Avengers: Age of Ultron,"$330,600,000","$459,005,868","$1,403,013,963"
4,5,"Dec 15, 2017",Star Wars Ep. VIII: The Last Jedi,"$317,000,000","$620,181,382","$1,316,721,747"

In [ ]:
gross_df.head()
gross_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2007 entries, 0 to 2006
Data columns (total 5 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   title           2007 non-null   object
 1   studio          2007 non-null   object
 2   domestic_gross  2007 non-null   float64
 3   foreign_gross   2007 non-null   float64
 4   year            2007 non-null   int64
dtypes: float64(2), int64(1), object(2)
memory usage: 78.5+ KB

Check for duplicates

In [ ]:
tn_budget_df.duplicated().value_counts()

False    5782
dtype: int64

Create month and year columns for categorical comparison. Then drop release date

In [ ]:
tn_budget_df_sorted = tn_budget_df.sort_values(by='domestic_gross', ascending=False)
tn_budget_df_sorted

,id,movie,production_budget,domestic_gross,worldwide_gross,release_month,release_year
5,6,Star Wars Ep. VII: The Force Awakens,306000000,936662225,2053311220,Dec,2015
0,1,Avatar,425000000,760507625,2776345279,Dec,2009
41,42,Black Panther,200000000,700059566,1348258224,Feb,2018
6,7,Avengers: Infinity War,300000000,678815482,2048134200,Apr,2018
42,43,Titanic,200000000,659363944,2208208395,Dec,1997
...,...,...,...,...,...,...,...
5637,38,Archaeology of a Woman,200000,0,0,Sep,2014
5595,96,The Frozen,250000,0,0,Dec,2012
5636,37,Yesterday Was a Lie,200000,0,0,Jan,2008
5634,35,The Man From Earth,200000,0,0,Oct,2007
5317,18,A Fine Step,1000000,0,0,Jun,2014

In [ ]:
tn_budget_df['release_month'] = tn_budget_df['release_date'].str.split(' ').str[0]
tn_budget_df['release_year'] = tn_budget_df['release_date'].str.split(' ').str[-1]
tn_budget_df = tn_budget_df.drop(columns='release_date')
tn_budget_df.head()

,id,movie,production_budget,domestic_gross,worldwide_gross,release_month,release_year
0,1,Avatar,"$425,000,000","$760,507,625","$2,776,345,279",Dec,2009
1,2,Pirates of the Caribbean: On Stranger Tides,"$410,600,000","$241,063,875","$1,045,663,875",May,2011
2,3,Dark Phoenix,"$350,000,000","$42,762,350","$149,762,350",Jun,2019
3,4,Avengers: Age of Ultron,"$330,600,000","$459,005,868","$1,403,013,963",May,2015
4,5,Star Wars Ep. VIII: The Last Jedi,"$317,000,000","$620,181,382","$1,316,721,747",Dec,2017

In [ ]:

tn_budget_df['domestic_gross'] = tn_budget_df['domestic_gross'].str.replace(r"[$,]", "", regex=True).astype(int)
tn_budget_df['production_budget'] = tn_budget_df['production_budget'].str.replace(r"[$,]", "", regex=True).astype(int)
tn_budget_df["worldwide_gross"] = pd.to_numeric(tn_budget_df["worldwide_gross"].str.replace(r"[$,]", "", regex=True))
tn_budget_df.info()
tn_budget_df.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5782 entries, 0 to 5781
Data columns (total 7 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   id                 5782 non-null   int64
 1   movie              5782 non-null   object
 2   production_budget  5782 non-null   int32
 3   domestic_gross     5782 non-null   int32
 4   worldwide_gross    5782 non-null   int64
 5   release_month      5782 non-null   object
 6   release_year       5782 non-null   object
dtypes: int32(2), int64(2), object(3)
memory usage: 271.2+ KB

,id,movie,production_budget,domestic_gross,worldwide_gross,release_month,release_year
0,1,Avatar,425000000,760507625,2776345279,Dec,2009
1,2,Pirates of the Caribbean: On Stranger Tides,410600000,241063875,1045663875,May,2011
2,3,Dark Phoenix,350000000,42762350,149762350,Jun,2019
3,4,Avengers: Age of Ultron,330600000,459005868,1403013963,May,2015
4,5,Star Wars Ep. VIII: The Last Jedi,317000000,620181382,1316721747,Dec,2017

In [ ]:
master_df = pd.merge(basic_df, rating_df, on='tconst', how='inner')
master_df = pd.merge(master_df, gross_df[['title','domestic_gross','foreign_gross']], how='left', left_on='movie_title',right_on='title')
master_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 73856 entries, 0 to 73855
Data columns (total 12 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   tconst           73856 non-null  object
 1   movie_title      73856 non-null  object
 2   start_year       73856 non-null  int64
 3   runtime_minutes  73856 non-null  int32
 4   genres           73856 non-null  object
 5   averagerating    73856 non-null  float64
 6   numvotes         73856 non-null  int64
 7   title            1810 non-null   object
 8   studio           1810 non-null   object
 9   domestic_gross   1810 non-null   float64
 10  foreign_gross    1810 non-null   float64
 11  year             1810 non-null   float64
dtypes: float64(4), int32(1), int64(2), object(5)
memory usage: 7.0+ MB

Don't need original_title
Clean up above before continuing

Correlations

In [ ]:
corr_df = master_df[['runtime_minutes','averageRating','numVotes','domestic_gross','foreign_gross']]
corr_matrix = corr_df.corr()

plt.figure(figsize=(10,6))
sns.heatmap(corr_matrix, annot=True, cmap='coolwarm')
plt.title("Correlation between ratings, runtime, votes and revenue")
plt.show()